_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияЦенОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РегистрацияЦенОбъектовНедвижимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УПН_ЦеныОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныОбъектовНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕдиницуПлощади</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ЦеныОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ЦеныОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаЕдиницуПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияЦенОбъектовНедвижимости/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ЗаполнитьТипЦен()
	
	ТипыЦенТабличнойЧасти = Объект.ЦеныОбъектовНедвижимости.Выгрузить(,"ВидЦены");
	ТипыЦенТабличнойЧасти.Свернуть("ВидЦены");
	Если ТипыЦенТабличнойЧасти.Количество()=1 Тогда
		ТипЦены = ТипыЦенТабличнойЧасти[0].ВидЦены;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоОбъектуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.УстановитьПараметр("ВидЦены",ТипЦены);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
	|	ЕСТЬNULL(ЦеныОбъектовНедвижимости.ВидЦены, &ВидЦены) КАК ВидЦены,
	|	ЦеныОбъектовНедвижимости.ЦенаЗаЕдиницуПлощади КАК ЦенаЗаЕдиницуПлощади,
	|	ЦеныОбъектовНедвижимости.Стоимость КАК Стоимость,
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ИЗ
	|	Справочник.АУН_ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ЦеныОбъектовНедвижимости.СрезПоследних(
	|				,
	|				ВЫБОР
	|					КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВидЦены = &ВидЦены
	|				КОНЕЦ) КАК ЦеныОбъектовНедвижимости
	|		ПО ОбъектыНедвижимости.Ссылка = ЦеныОбъектовНедвижимости.ОбъектНедвижимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(, ) КАК ПлощадиОбъектовНедвижимости
	|		ПО (ПлощадиОбъектовНедвижимости.ОбъектНедвижимости = ОбъектыНедвижимости.Ссылка)
	|ГДЕ
	|	(ОбъектыНедвижимости.ПринадлежитОбъекту = &Здание
	|			ИЛИ ОбъектыНедвижимости.Ссылка = &Здание)
	|	И НЕ ОбъектыНедвижимости.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Объект.ЦеныОбъектовНедвижимости.Очистить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество() > 1 И Выборка.ОбъектНедвижимости = Объект.Здание Тогда
			Продолжить;				
		КонецЕсли;
		НоваяСтрока = Объект.ЦеныОбъектовНедвижимости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщуюПлощадь()
	
	Для Каждого СтрокаТЧ Из Объект.ЦеныОбъектовНедвижимости Цикл
		СтрокаТЧ.ОбщаяПлощадь = УПН_ОбщиеПроцедуры.ПолучитьОбщуюПлощадьПоОбъектуНедвижимости(СтрокаТЧ.ОбъектНедвижимости, ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтоимость(ТекущиеДанные)
	
	ТекущиеДанные.Стоимость = ТекущиеДанные.ОбщаяПлощадь * ТекущиеДанные.ЦенаЗаЕдиницуПлощади;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНедвижимостиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦеныОбъектовНедвижимости.ТекущиеДанные;
	ТекущиеДанные.ОбщаяПлощадь = УПН_ОбщиеПроцедуры.ПолучитьОбщуюПлощадьПоОбъектуНедвижимости(ТекущиеДанные.ОбъектНедвижимости, Объект.Дата);
	РассчитатьСтоимость(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗаЕдиницуПлощадиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦеныОбъектовНедвижимости.ТекущиеДанные;
	РассчитатьСтоимость(ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТипЦен();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьОбщуюПлощадь();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбъектовНедвижимостиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущаяСтрока = Элементы.ЦеныОбъектовНедвижимости.ТекущиеДанные;
        ТекущаяСтрока.ВидЦены = ТипЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОбъекту(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите здание, по которому необходимо заполнить табличную часть.";
		Сообщение.Поле = "Здание";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ЦеныОбъектовНедвижимости.Количество() Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОбъектуЗавершение", ЭтотОбъект), "Табличная часть документа будет очищена, продолжить?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоОбъектуЗавершение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОбъектуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьЦеныПоОбъектуНаСервере();
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьОбщуюПлощадь();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеТекущихЦенКлиент(ПараметрЧисло,ПараметрОперации) Экспорт
	Если ПараметрЧисло=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ПараметрОперации = ""  И ПараметрЧисло = 0 Тогда
		ПоказатьПредупреждение(,"Деление на ноль запрещено!");
		Возврат;
	КонецЕсли;
	Для Каждого СтрТЧ Из Объект.ЦеныОбъектовНедвижимости Цикл
		Если ПараметрОперации="Увеличить" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади + ПараметрЧисло;	
		ИначеЕсли ПараметрОперации="Уменьшить" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади - ПараметрЧисло;	
		ИначеЕсли ПараметрОперации="Умножить" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади * ПараметрЧисло;	
		ИначеЕсли ПараметрОперации="Разделить" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади / ПараметрЧисло;
		ИначеЕсли ПараметрОперации="Разделить" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади / ПараметрЧисло;
		ИначеЕсли ПараметрОперации="УвеличитьНаПроцент" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади + ПараметрЧисло*СтрТЧ.ЦенаЗаЕдиницуПлощади/100;	
		ИначеЕсли ПараметрОперации="УменьшитьНаПроцент" Тогда
			СтрТЧ.ЦенаЗаЕдиницуПлощади = СтрТЧ.ЦенаЗаЕдиницуПлощади - ПараметрЧисло*СтрТЧ.ЦенаЗаЕдиницуПлощади/100;	
		КонецЕсли;	
		РассчитатьСтоимость(СтрТЧ);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьТекущиеЦены(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменениеТекущихЦенКлиент",ЭтотОбъект,"Увеличить"),0,"Увеличить текущие цены на:",12,2);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьТекущиеЦены(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменениеТекущихЦенКлиент",ЭтотОбъект,"Уменьшить"),0,"Уменьшить текущие цены на:",12,2);
КонецПроцедуры

&НаКлиенте
Процедура РазделитьТекущиеЦены(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменениеТекущихЦенКлиент",ЭтотОбъект,"Разделить"),0,"Разделить текущие цены на:",12,2);
КонецПроцедуры

&НаКлиенте
Процедура УмножитьТекущиеЦены(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменениеТекущихЦенКлиент",ЭтотОбъект,"Умножить"),0,"Умножить текущие цены на:",12,2);
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьТекущиеЦеныНаПроцент(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменениеТекущихЦенКлиент",ЭтотОбъект,"УвеличитьНаПроцент"),0,"Увеличить текущие цены на %:",12,2);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьТекущиеЦеныНаПроцент(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменениеТекущихЦенКлиент",ЭтотОбъект,"УменьшитьНаПроцент"),0,"Уменьшить текущие цены на %:",12,2);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦеныОбъектовНедвижимости.ТекущиеДанные;
	ТекущиеДанные.ЦенаЗаЕдиницуПлощади = ?(ТекущиеДанные.ОбщаяПлощадь = 0,0,ТекущиеДанные.Стоимость/ТекущиеДанные.ОбщаяПлощадь);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	

КонецПроцедуры

#КонецОбласти
